app/controllers/admin/customers_controller.rb

SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "customers"
---
    def index
        @customers = Customer.page(params[:page]).per(10)

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "is_subscribed" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_subscribed", 0], ["updated_at", "2021-09-19 21:12:01.848909"], ["id", 2]]
---
    def update
        @customer = Customer.find(params[:id])
        @customer.is_subscribed = params[:customer][:is_subscribed].to_i
        if @customer.update(custmer_params)