app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "チョコ"], ["created_at", "2021-09-03 14:19:19.221270"], ["updated_at", "2021-09-03 14:19:19.221270"]]
---
    def create
        @genre = Genre.new(genre_params)
        if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        @genre = Genre.find(params[:id])