app/controllers/admin/items_controller.rb

    def index
        @items=Item.page(params[:page]).per(8)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

    def new
         @item = Item.new
         @genres = Genre.all
---
SELECT "genres".* FROM "genres"

    def edit
        @item = Item.find(params[:id])
        @genres = Genre.all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"

    def create
        @item = Item.new(item_params)
        @genres = Genre.all
        if @item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @item = Item.find(params[:id])
        @genres = Genre.all
        if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "introduction" = ?, "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["introduction", "めちゃくちゃうまい！のか？"], ["image_id", "b76ea2d4233870e3a56f2e0ce3566bd6a24db5ea8b3cbd814417b3da536c"], ["updated_at", "2021-09-24 13:50:58.762839"], ["id", 1]]