app/controllers/admin/orders_controller.rb

SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
---
    def index
        @orders = Order.all