app/controllers/admin/orders_controller.rb

    def index
        case params[:order_sort]
        when "0"
            @customer = Customer.find(params[:id])
            @orders = @customer.orders.page(params[:page]).per(10)
        else
            @orders = Order.all.page(params[:page]).per(10)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? LIMIT ? OFFSET ?  [["customer_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 2]]
SELECT  "orders".* FROM "orders" WHERE "orders"."customer_id" = ? LIMIT ?  [["customer_id", 2], ["LIMIT", 11]]

    def show
        @order = Order.find(params[:id])
        @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]

    def update
        order = Order.find(params[:id])
        order.update(order_params)
        order_details = order.order_details
        if order.status == "confirm"
            order_details.each do |order_detail|
                order_detail.update(makeing_status: "waiting")
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2021-09-04 01:31:57.473505"], ["id", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
UPDATE "order_details" SET "makeing_status" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["makeing_status", 1], ["updated_at", "2021-09-04 01:31:57.512632"], ["id", 1]]