app/controllers/admin/searches_controller.rb

  def search
    if params[:search].present?
      if params[:model] == "user"
          if params[:how] == "0"
              @customers = Customer.where("last_name + first_name LIKE ?", "#{params[:search]}")
          elsif params[:how] == "1"
              @customers = Customer.where("last_name + first_name LIKE ?", "#{params[:search]}%")
          elsif params[:how] == "2"
              @customers = Customer.where("last_name + first_name LIKE ?", "%#{params[:search]}")
          else
              @customers = Customer.where(['last_name + first_name LIKE ?', "%#{params[:search]}%"])
          end
          render "admin/customers/index"
      elsif params[:model] == "item"
          if params[:how] == "0"
              @items = Item.where("name LIKE ?", "#{params[:search]}")
---
SELECT  "customers".* FROM "customers" WHERE (name LIKE 'yuyayamada') LIMIT ?  [["LIMIT", 11]]
SELECT "items".* FROM "items" WHERE (name LIKE 'サクサクチョコ')