app/views/admin/orders/show.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <th>購入者</th>
            <td><%= @order.customer.last_name%><%= @order.customer.first_name %></td>

SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
                            <%= form_with model:order_detail, url: admin_order_detail_path(order_detail.id), local:true do |f| %>
                                <%= f.select :makeing_status, OrderDetail.makeing_statuses_i18n.invert %>