app/controllers/publics/addresses_controller.rb

SELECT "addresses".* FROM "addresses"
---
    def index
        @address = Address.new
        @addresses = Address.all

SELECT "addresses".* FROM "addresses"
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 2], ["name", "山田佑弥"], ["postal_code", "2230064"], ["address", "神奈川県横浜市港北区下田町1-14-4"], ["created_at", "2021-09-27 17:45:40.406295"], ["updated_at", "2021-09-27 17:45:40.406295"]]
---
    def create
        address = Address.new(addresses_params)
        address.customer_id = current_customer.id
        @addresses = Address.all
        if address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @address = Address.find(params[:id])

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["address", "神奈川県横浜市港北区下田町1-14-4"], ["updated_at", "2021-09-07 05:31:13.400646"], ["id", 1]]
---
    def update
        @address = Address.find(params[:id])
        if @address.update(addresses_params)