app/controllers/publics/cart_items_controller.rb

    def index
        @cart_items = CartItem.all
---
SELECT "cart_items".* FROM "cart_items"

    def create
        @cart_item = CartItem.new(cart_items_params)
        @cart_items = current_customer.cart_items.all
        # ↓新規作成された商品とカート内にある商品をeach文を用いて検査して、もし同じであればまとめる。
        @cart_items.each do |cart_item|
          if cart_item.item_id == @cart_item.item_id
            new_amount = cart_item.amount + @cart_item.amount
            cart_item.update(amount: new_amount)
            @cart_item.delete
          end
        end
        # ↓current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id]).present? でもいける。
        # if current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id]).present?
        #     @before_cart_item = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
        #     new_amount = @cart_item.amount + @before_cart_item.amount
        #     @before_cart_item.update(amount: new_amount)
        #     @cart_item.delete
        # end
        @cart_item.save
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "cart_items" ("customer_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["item_id", 1], ["amount", 3], ["created_at", "2021-09-03 14:20:26.853816"], ["updated_at", "2021-09-03 14:20:26.853816"]]

    def update
        @cart_item = CartItem.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def destroy
        @cart_item = CartItem.find(params[:id])
        @cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]

    def destroy_all
        @cart_item = current_customer.cart_items
        @cart_item.destroy_all
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 10]]