app/controllers/publics/customers_controller.rb

    def update
        @customer = current_customer
        if @customer.update(custmer_params)
---
UPDATE "customers" SET "last_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["last_name", "佑弥"], ["last_name_kana", "ユウヤ"], ["first_name_kana", "ヤマダ"], ["updated_at", "2021-09-08 04:04:35.334224"], ["id", 1]]

    def withdraw
        @customer = current_customer
        @customer.update(is_subscribed: 0)
---
UPDATE "customers" SET "is_subscribed" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_subscribed", 0], ["updated_at", "2021-09-29 04:10:56.687872"], ["id", 2]]