app/controllers/publics/homes_controller.rb

SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" ORDER BY "items"."created_at" ASC LIMIT ?  [["LIMIT", 4]]
---
    def about
        @genres = Genre.all
        @items = Item.all.order(created_at: :desc).last(4)