app/controllers/publics/homes_controller.rb

    def top
        @genres = Genre.all
        @items = Item.all.order(created_at: :desc).limit(4)
---
SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" ORDER BY "items"."created_at" DESC LIMIT ?  [["LIMIT", 4]]