app/controllers/publics/items_controller.rb

SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"
SELECT "genres".* FROM "genres"
---
    def index
        @items = Item.all.page(params[:page]).per(8)
        @genres = Genre.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
    def show
        @item = Item.find(params[:id])
        @cart_item = CartItem.new
        @genres = Genre.all