app/controllers/publics/orders_controller.rb

    def confirm
        @cart_items = current_customer.cart_items
        @order = Order.new(order_params)
        @order.payment_method = params[:order][:payment_method].to_i
        if params[:order][:address_option] == "0"
            @order.name = current_customer.last_name + current_customer.first_name
            @order.postal_code = current_customer.postcode
            @order.address = current_customer.address
        elsif params[:order][:address_option] == "1"
            @address = Address.find(params[:order][:address_id].to_i)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @order = Order.new(order_params)
        @order.payment_method = params[:order][:payment_method]
        @order.customer_id = current_customer.id
        @order.shipping_cost = 800
        @order.save
        current_customer.cart_items.each do |cart_item|
            @order_item = OrderDetail.new
            @order_item.order_id = @order.id
            @order_item.amount = cart_item.amount
            @order_item.price = (cart_item.item.price * 1.1).floor
            @order_item.item_id = cart_item.item_id
            @order_item.save
        end
        # ↑order_detailに保存する
        current_customer.cart_items.destroy_all
---
INSERT INTO "orders" ("customer_id", "address", "name", "postal_code", "shipping_cost", "total_payment", "payment_method", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 3]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 2], ["item_id", 2], ["price", 1089], ["amount", 5], ["created_at", "2021-09-21 03:11:27.774329"], ["updated_at", "2021-09-21 03:11:27.774329"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]