app/controllers/publics/searches_controller.rb

SELECT  "items".* FROM "items" WHERE (cast(genre_id as text) LIKE '3') LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" WHERE (cast(genre_id as text) LIKE '3') LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 8], ["OFFSET", 0]]
SELECT "genres".* FROM "genres"
---
  def top
    if params[:order_sort] == "0"
      @items = Item.where("genre_id LIKE ?", "#{params[:search]}").page(params[:page]).per(8)
      @genres = Genre.all