app/controllers/publics/sessions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "test@test"], ["LIMIT", 1]]
---
  def reject_inactive_user
    @customer = Customer.find_by(email: params[:customer][:email])